app/Controllers/Admin.php

    public function updateStatus(int $id)
    {
        $status  = $this->request->getPost('status');
        $allowed = ['pending', 'confirmed', 'completed', 'cancelled'];

        if (! in_array($status, $allowed, true)) {
            return redirect()->back()->with('error', 'Status tidak valid.');
        }

        $booking = $this->bookings->find($id);
        if (! $booking) {
            return redirect()->back()->with('error', 'Booking tidak ditemukan.');
        }

        $this->bookings->update($id, ['status' => $status]);
---
SELECT *
FROM `bookings`
WHERE `bookings`.`id` = 1
UPDATE `bookings` SET `status` = 'pending', `updated_at` = '2026-06-25 06:45:37'
WHERE `bookings`.`id` IN (1)