app/Models/AdminModel.php

    public function verify(string $username, string $password): ?array
    {
        $admin = $this->where('username', $username)->first();
---
SELECT *
FROM `admins`
WHERE `username` = 'admin'
 LIMIT 1