app/Models/BookingModel.php

SELECT `bookings`.*, `users`.`name` AS `customer_name`, `users`.`phone` AS `customer_phone`, `users`.`email` AS `customer_email`, `services`.`name` AS `service_name`, `services`.`price_estimate` AS `service_price`
FROM `bookings`
JOIN `users` ON `users`.`id` = `bookings`.`user_id`
JOIN `services` ON `services`.`id` = `bookings`.`service_id`
WHERE `bookings`.`status` = 'pending'
ORDER BY `bookings`.`booking_date` DESC, `bookings`.`time_slot` ASC
---
    public function withRelations(?string $status = null): array
    {
        $builder = $this->select('
                bookings.*,
                users.name AS customer_name,
                users.phone AS customer_phone,
                users.email AS customer_email,
                services.name AS service_name,
                services.price_estimate AS service_price
            ')
            ->join('users', 'users.id = bookings.user_id')
            ->join('services', 'services.id = bookings.service_id')
            ->orderBy('bookings.booking_date', 'DESC')
            ->orderBy('bookings.time_slot', 'ASC');

        if ($status !== null && $status !== '') {
            $builder->where('bookings.status', $status);
        }

        return $builder->findAll();

SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
AND `status` = 'confirmed'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
AND `status` = 'confirmed'
AND `status` = 'completed'
---
    public function stats(): array
    {
        return [
            'total'     => $this->countAllResults(false),
            'pending'   => $this->where('status', 'pending')->countAllResults(false),
            'confirmed' => $this->where('status', 'confirmed')->countAllResults(false),
            'completed' => $this->where('status', 'completed')->countAllResults(false),