app/Models/ServiceModel.php

SELECT *
FROM `services`
WHERE `is_active` = 1
ORDER BY `id` ASC
---
    public function active(): array
    {
        return $this->where('is_active', 1)->orderBy('id', 'ASC')->findAll();